list_of_lists/app/views/users/show.html.erb

            <h2>My List of Lists listed in a list:</h2>
            <% @user.lists.each do |list|%>
---
SELECT "lists".* FROM "lists" INNER JOIN "list_users" ON "lists"."id" = "list_users"."list_id" WHERE "list_users"."user_id" = $1  [["user_id", 64]]