list_of_lists/app/views/lists/_book.html.erb

<% @list.books.each do |book|%>
---
SELECT "books".* FROM "books" WHERE "books"."list_id" = $1  [["list_id", 101]]