list_of_lists/app/views/lists/_place.html.erb

SELECT "places".* FROM "places" WHERE "places"."list_id" = $1  [["list_id", 103]]
---
<% @list.places.each do |place|%>