list_of_lists/app/views/lists/_rando.html.erb

SELECT "randos".* FROM "randos" WHERE "randos"."list_id" = $1  [["list_id", 104]]
---
<% @list.randos.each do |rando|%>