list_of_lists/app/views/lists/_song.html.erb

SELECT "songs".* FROM "songs" WHERE "songs"."list_id" = $1  [["list_id", 105]]
---
<% @list.songs.each do |song|%>