list_of_lists/app/controllers/books_controller.rb

    def edit
    	@book = Book.find_by_id(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 96], ["LIMIT", 1]]

    def destroy
    	@book = Book.find_by_id(params[:id])
    	@book.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 33]]