list_of_lists/app/controllers/lists_controller.rb

	def show
        @list = List.find_by_id(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def edit
    	@list = List.find_by_id(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 96], ["LIMIT", 1]]