list_of_lists/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "first_name", "last_name", "bio", "password_digest", "img_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    def create
    	@user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 65], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 65]]
---
   	def destroy
   		@user = User.find_by_id(params[:id])
   		@user.destroy