app/controllers/welcome_controller.rb

	def index
		@features = List.last(3).reverse
---
SELECT  "lists".* FROM "lists" ORDER BY "lists"."id" DESC LIMIT $1  [["LIMIT", 3]]